app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "abc"], ["created_at", "2021-09-30 21:40:56.764644"], ["updated_at", "2021-09-30 21:40:56.764644"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2, "author" = $3, "price" = $4, "publish_date" = $5 WHERE "books"."id" = $6  [["title", "Percy Jackson"], ["updated_at", "2021-10-01 01:43:27.508876"], ["author", "Rick Riordan"], ["price", 24.0], ["publish_date", "2015-12-12"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)